---
kind: property
id: P:Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceAnisotropy
source: html/9d570949-b5c8-c607-4cd0-775b25a7ce81.htm
---
# Autodesk.Revit.DB.Visual.AdvancedLayered.SurfaceAnisotropy Property

The property labeled "Anisotropy" from the "AdvancedLayered" schema.

## Syntax (C#)
```csharp
public static string SurfaceAnisotropy { get; }
```

## Remarks
This property is of type "AssetPropertyDouble".
 This property allows a connected asset.